## 🧾 Terraform Plan for `sec_inspector`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.inspector_advanced.aws_inspector2_delegated_admin_account.this[0] will be created
  + resource "aws_inspector2_delegated_admin_account" "this" {
      + account_id          = "123456789012"
      + id                  = (known after apply)
      + relationship_status = (known after apply)
    }

  # module.inspector_advanced.aws_inspector2_organization_configuration.this[0] will be created
  + resource "aws_inspector2_organization_configuration" "this" {
      + id                        = (known after apply)
      + max_account_limit_reached = (known after apply)

      + auto_enable {
          + ec2    = true
          + ecr    = true
          + lambda = true
        }
    }

  # module.inspector_basic.aws_inspector2_enabler.this[0] will be created
  + resource "aws_inspector2_enabler" "this" {
      + account_ids    = [
          + "111122223333",
          + "444455556666",
        ]
      + id             = (known after apply)
      + resource_types = [
          + "EC2",
          + "ECR",
        ]
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->